In [1]:
import pandas as pd

In [11]:
df=pd.read_csv('train.csv')
df

,customer_id,customer_age,education_level,marital_status,income_category,number_products_customer,weeks_tenure,contacts_last_12mths,credit_limit,card_class,inactive_months_last_12mths,total_revolving_balance,count_transactions,transactions_amount,change_transaction_amt_last_3mths,change_transaction_count_last_3mths,churn
0,4278,NaN,phd,NaN,30k€-50k€,4,216,1,16541.0,red plus,2,1428,82,4352,0.846,0.907,0
1,7300,45.0,graduate,single,<30k€,5,115,3,1438.3,red,3,576,66,5098,0.774,0.833,0
2,6857,NaN,uneducated,married,30k€-50k€,6,172,2,2293.0,red,1,1460,74,4436,0.658,0.542,0
3,2508,39.0,graduate,married,70k€-110k€,5,124,2,17523.0,red,2,0,54,1974,0.424,0.688,1
4,7859,40.0,graduate,single,<30k€,2,107,2,4391.0,red,2,1933,36,1849,0.579,0.385,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4387,8590,27.0,high school,single,NaN,5,147,3,3184.0,red,2,1421,59,2253,0.712,0.439,0
4388,8131,50.0,NaN,married,<30k€,3,175,0,5139.0,red,3,0,44,1653,0.330,0.692,1
4389,3445,48.0,uneducated,single,<30k€,3,180,2,2094.0,red,3,0,46,2690,0.897,0.484,1
4390,2832,NaN,graduate,divorced,30k€-50k€,1,116,3,5821.0,red,2,894,42,2011,0.461,0.273,1
4391,529,58.0,uneducated,single,NaN,5,191,1,5261.0,red,2,1966,86,4448,0.672,0.792,0

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4392 entries, 0 to 4391
Data columns (total 17 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4392 non-null   int64
 1   customer_age                         3963 non-null   float64
 2   education_level                      3735 non-null   object
 3   marital_status                       4074 non-null   object
 4   income_category                      3891 non-null   object
 5   number_products_customer             4392 non-null   int64
 6   weeks_tenure                         4392 non-null   int64
 7   contacts_last_12mths                 4392 non-null   int64
 8   credit_limit                         4392 non-null   float64
 9   card_class                           4392 non-null   object
 10  inactive_months_last_12mths          4392 non-null   int64
 11  total_revolving_balance              4392 non-null   int64
 12  count_transactions                   4392 non-null   int64
 13  transactions_amount                  4392 non-null   int64
 14  change_transaction_amt_last_3mths    4392 non-null   float64
 15  change_transaction_count_last_3mths  4392 non-null   float64
 16  churn                                4392 non-null   int64
dtypes: float64(4), int64(9), object(4)
memory usage: 583.4+ KB

In [23]:
df['customer_age'].describe() #Rellenar con media

count    4392.000000
mean       45.697177
std         8.131649
min        15.000000
25%        41.000000
50%        45.000000
75%        51.000000
max        77.000000
Name: customer_age, dtype: float64

In [24]:
df['education_level'].value_counts() #Rellenar con moda

graduate         2010
high school       872
uneducated        632
college           439
post-graduate     232
phd               207
Name: education_level, dtype: int64

In [25]:
df['marital_status'].value_counts() #Rellenar con moda

married     2341
single      1724
divorced     327
Name: marital_status, dtype: int64

In [26]:
df['income_category'].value_counts() #Rellenar con moda

<30k€         2031
30k€-50k€      776
70k€-110k€     682
50k€-70k€      597
+110k€         306
Name: income_category, dtype: int64

In [22]:
#Limpieza
df['customer_age'].fillna(value=45, inplace=True)
df['education_level'].fillna(value='graduate', inplace=True)
df['marital_status'].fillna(value='married', inplace=True)
df['income_category'].fillna(value='<30k€', inplace=True)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4392 entries, 0 to 4391
Data columns (total 17 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4392 non-null   int64
 1   customer_age                         4392 non-null   float64
 2   education_level                      4392 non-null   object
 3   marital_status                       4392 non-null   object
 4   income_category                      4392 non-null   object
 5   number_products_customer             4392 non-null   int64
 6   weeks_tenure                         4392 non-null   int64
 7   contacts_last_12mths                 4392 non-null   int64
 8   credit_limit                         4392 non-null   float64
 9   card_class                           4392 non-null   object
 10  inactive_months_last_12mths          4392 non-null   int64
 11  total_revolving_balance              4392 non-null   int64
 12  count_transactions                   4392 non-null   int64
 13  transactions_amount                  4392 non-null   int64
 14  change_transaction_amt_last_3mths    4392 non-null   float64
 15  change_transaction_count_last_3mths  4392 non-null   float64
 16  churn                                4392 non-null   int64
dtypes: float64(4), int64(9), object(4)
memory usage: 583.4+ KB

In [29]:
#Cambio de variables categoricas a numericas
from sklearn.preprocessing import LabelEncoder

class MultiColumnLabelEncoder: #Class for change multiple objects to numeric values
    def __init__(self,columns = None):
        self.columns = columns

    def fit(self,X,y=None):
        return self

    def transform(self,X):
        output = X.copy()
        if self.columns is not None:
            for col in self.columns:
                output[col] = LabelEncoder().fit_transform(output[col])
        else:
            for colname,col in output.iteritems():
                output[colname] = LabelEncoder().fit_transform(col)
        return output

    def fit_transform(self,X,y=None):
        return self.fit(X,y).transform(X)

df=MultiColumnLabelEncoder(columns=['education_level', 'marital_status', 'income_category', 'card_class']).fit_transform(df)

df.info() #Se verifica que todas las variables ahora son numéricas

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4392 entries, 0 to 4391
Data columns (total 17 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4392 non-null   int64
 1   customer_age                         4392 non-null   float64
 2   education_level                      4392 non-null   int64
 3   marital_status                       4392 non-null   int64
 4   income_category                      4392 non-null   int64
 5   number_products_customer             4392 non-null   int64
 6   weeks_tenure                         4392 non-null   int64
 7   contacts_last_12mths                 4392 non-null   int64
 8   credit_limit                         4392 non-null   float64
 9   card_class                           4392 non-null   int64
 10  inactive_months_last_12mths          4392 non-null   int64
 11  total_revolving_balance              4392 non-null   int64
 12  count_transactions                   4392 non-null   int64
 13  transactions_amount                  4392 non-null   int64
 14  change_transaction_amt_last_3mths    4392 non-null   float64
 15  change_transaction_count_last_3mths  4392 non-null   float64
 16  churn                                4392 non-null   int64
dtypes: float64(4), int64(13)
memory usage: 583.4 KB

In [36]:
#Division en train y test
from sklearn.model_selection import train_test_split
ctrain,ctest=train_test_split(df,test_size=0.2,shuffle=True)

In [41]:
ctrain_x=ctrain[['customer_age',
                'education_level',
                'marital_status',
                'income_category',
                'number_products_customer',
                'weeks_tenure',
                'contacts_last_12mths',
                'credit_limit',
                'card_class',
                'inactive_months_last_12mths',
                'total_revolving_balance',
                'count_transactions',
                'transactions_amount',
                'change_transaction_amt_last_3mths',
                'change_transaction_count_last_3mths']]
ctrain_y=ctrain['churn']

ctest_x=ctest[['customer_age',
                'education_level',
                'marital_status',
                'income_category',
                'number_products_customer',
                'weeks_tenure',
                'contacts_last_12mths',
                'credit_limit',
                'card_class',
                'inactive_months_last_12mths',
                'total_revolving_balance',
                'count_transactions',
                'transactions_amount',
                'change_transaction_amt_last_3mths',
                'change_transaction_count_last_3mths']]
ctest_y=ctest['churn']

In [43]:
#Entrenamiento del modelo
from sklearn.tree import DecisionTreeClassifier
cl=DecisionTreeClassifier(criterion='gini',max_depth=19,random_state=0)
cl.fit(ctrain_x,ctrain_y)

DecisionTreeClassifier(max_depth=19, random_state=0)

In [44]:
cpredict_y=cl.predict(ctest_x)

In [45]:
#Métricas
from sklearn import metrics
print("Accuracy= ",metrics.accuracy_score(cpredict_y,ctest_y))
print("Precision= ",metrics.precision_score(cpredict_y,ctest_y,average=None))
print("recall= ",metrics.recall_score(cpredict_y,ctest_y,average=None))
print("F1= ",metrics.f1_score(cpredict_y,ctest_y,average=None))

Accuracy=  0.9237770193401593
Precision=  [0.96330275 0.80888889]
recall=  [0.93610698 0.88349515]
F1=  [0.94951017 0.84454756]

# Datos Test

In [50]:
dft=pd.read_csv('test.csv')
dft.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1883 entries, 0 to 1882
Data columns (total 16 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          1883 non-null   int64
 1   customer_age                         1688 non-null   float64
 2   education_level                      1604 non-null   object
 3   marital_status                       1741 non-null   object
 4   income_category                      1681 non-null   object
 5   number_products_customer             1883 non-null   int64
 6   weeks_tenure                         1883 non-null   int64
 7   contacts_last_12mths                 1883 non-null   int64
 8   credit_limit                         1883 non-null   float64
 9   card_class                           1883 non-null   object
 10  inactive_months_last_12mths          1883 non-null   int64
 11  total_revolving_balance              1883 non-null   int64
 12  count_transactions                   1883 non-null   int64
 13  transactions_amount                  1883 non-null   int64
 14  change_transaction_amt_last_3mths    1883 non-null   float64
 15  change_transaction_count_last_3mths  1883 non-null   float64
dtypes: float64(4), int64(8), object(4)
memory usage: 235.5+ KB

In [49]:
dft['customer_age'].describe()

count    1688.000000
mean       46.014218
std         8.694433
min        21.000000
25%        40.000000
50%        46.000000
75%        52.000000
max        73.000000
Name: customer_age, dtype: float64

In [51]:
dft['education_level'].value_counts()

graduate         581
high school      351
uneducated       279
college          210
post-graduate     95
phd               88
Name: education_level, dtype: int64

In [52]:
dft['marital_status'].value_counts()

married     880
single      730
divorced    131
Name: marital_status, dtype: int64

In [53]:
dft['income_category'].value_counts()

<30k€         651
30k€-50k€     348
70k€-110k€    282
50k€-70k€     254
+110k€        146
Name: income_category, dtype: int64

In [54]:
#Limpieza
dft['customer_age'].fillna(value=46, inplace=True)
dft['education_level'].fillna(value='graduate', inplace=True)
dft['marital_status'].fillna(value='married', inplace=True)
dft['income_category'].fillna(value='<30k€', inplace=True)

In [55]:
dft.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1883 entries, 0 to 1882
Data columns (total 16 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          1883 non-null   int64
 1   customer_age                         1883 non-null   float64
 2   education_level                      1883 non-null   object
 3   marital_status                       1883 non-null   object
 4   income_category                      1883 non-null   object
 5   number_products_customer             1883 non-null   int64
 6   weeks_tenure                         1883 non-null   int64
 7   contacts_last_12mths                 1883 non-null   int64
 8   credit_limit                         1883 non-null   float64
 9   card_class                           1883 non-null   object
 10  inactive_months_last_12mths          1883 non-null   int64
 11  total_revolving_balance              1883 non-null   int64
 12  count_transactions                   1883 non-null   int64
 13  transactions_amount                  1883 non-null   int64
 14  change_transaction_amt_last_3mths    1883 non-null   float64
 15  change_transaction_count_last_3mths  1883 non-null   float64
dtypes: float64(4), int64(8), object(4)
memory usage: 235.5+ KB

In [56]:
#Cambio de variables categoricas a numericas
from sklearn.preprocessing import LabelEncoder

class MultiColumnLabelEncoder: #Class for change multiple objects to numeric values
    def __init__(self,columns = None):
        self.columns = columns

    def fit(self,X,y=None):
        return self

    def transform(self,X):
        output = X.copy()
        if self.columns is not None:
            for col in self.columns:
                output[col] = LabelEncoder().fit_transform(output[col])
        else:
            for colname,col in output.iteritems():
                output[colname] = LabelEncoder().fit_transform(col)
        return output

    def fit_transform(self,X,y=None):
        return self.fit(X,y).transform(X)

dft=MultiColumnLabelEncoder(columns=['education_level', 'marital_status', 'income_category', 'card_class']).fit_transform(dft)

dft.info() #Se verifica que todas las variables ahora son numéricas

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1883 entries, 0 to 1882
Data columns (total 16 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          1883 non-null   int64
 1   customer_age                         1883 non-null   float64
 2   education_level                      1883 non-null   int64
 3   marital_status                       1883 non-null   int64
 4   income_category                      1883 non-null   int64
 5   number_products_customer             1883 non-null   int64
 6   weeks_tenure                         1883 non-null   int64
 7   contacts_last_12mths                 1883 non-null   int64
 8   credit_limit                         1883 non-null   float64
 9   card_class                           1883 non-null   int64
 10  inactive_months_last_12mths          1883 non-null   int64
 11  total_revolving_balance              1883 non-null   int64
 12  count_transactions                   1883 non-null   int64
 13  transactions_amount                  1883 non-null   int64
 14  change_transaction_amt_last_3mths    1883 non-null   float64
 15  change_transaction_count_last_3mths  1883 non-null   float64
dtypes: float64(4), int64(12)
memory usage: 235.5 KB

In [57]:
dft_x=dft[['customer_age',
                'education_level',
                'marital_status',
                'income_category',
                'number_products_customer',
                'weeks_tenure',
                'contacts_last_12mths',
                'credit_limit',
                'card_class',
                'inactive_months_last_12mths',
                'total_revolving_balance',
                'count_transactions',
                'transactions_amount',
                'change_transaction_amt_last_3mths',
                'change_transaction_count_last_3mths']]

In [59]:
dft_y=cl.predict(dft_x)

In [64]:
dft['churn']=dft_y.tolist()

In [67]:
dft[['customer_id', 'churn']].to_csv('submission.csv', index=False)